/*
#############################################################################################
# Rocket League SDK (RLSDK) Season 20 (v2.61)
# Generated with CodeRedGenerator v1.1.5 on 11/05/2025 07:11PM
# ========================================================================================= #
# File: TAGame_structs.hpp
# ========================================================================================= #
# Psyonix Build ID: 251020.62592.500294
# Build Date: Oct 20 2025 19:02:19
# ========================================================================================= #
# Credits: ItsBranK, TheFeckless, SSLow
# Links: www.github.com/CodeRedModding/CodeRed-Generator, discord.gg/d5ahhQmJbJ
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
#pragma pack(push, 0x1)
#endif

/*
# ========================================================================================= #
# Structs
# ========================================================================================= #
*/

// ScriptStruct TAGame.ConsecutiveMatchTracker_TA.MatchData
// Size: 0x0050 (0x004C PropertySize + 0x0004 padding to satisfy MinAlignment of 8)
struct FMatchData
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            ConsecutiveMatchesPlayed;                      // 0x0048 (0x0004) [0x0000000000000000]               
	uint8_t                                          MinAlignmentPadding[0x4];                      // 0x004C (0x0004) PADDING FOR MINALIGNMENT
};

// ScriptStruct TAGame._Types_TA.PrespawnData
// Size: 0x001C
struct FPrespawnData
{
	uint32_t                                           bPrespawnSet : 1;                              // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FVector                                     Location;                                      // 0x0004 (0x000C) [0x0000000000000000]               
	struct FRotator                                    Rotation;                                      // 0x0010 (0x000C) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.VoiceRoomCredentials
// Size: 0x0030
struct FVoiceRoomCredentials
{
	class FString                                      RoomId;                                        // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      BaseUrl;                                       // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      Token;                                         // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.PlayerVoiceRoomCredentials
// 0x0048 (0x0030 - 0x0078)
struct FPlayerVoiceRoomCredentials : FVoiceRoomCredentials
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0030 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ActivePlayerVoice
// Size: 0x0018 (0x0011 PropertySize + 0x0007 padding to satisfy MinAlignment of 8)
struct FActivePlayerVoice
{
	uint64_t                                           StartTimestamp;                                // 0x0000 (0x0008) [0x0000000000000000]               
	uint64_t                                           EndTimestamp;                                  // 0x0008 (0x0008) [0x0000000000000000]               
	uint8_t                                            Location;                                      // 0x0010 (0x0001) [0x0000000000000000]               
	uint8_t                                          MinAlignmentPadding[0x7];                      // 0x0011 (0x0007) PADDING FOR MINALIGNMENT
};

// ScriptStruct TAGame._Types_TA.VoiceRoomErrorMetric
// Size: 0x0010
struct FVoiceRoomErrorMetric
{
	class FName                                        ErrorName;                                     // 0x0000 (0x0008) [0x0000000000000000]               
	uint64_t                                           TimeStamp;                                     // 0x0008 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.VoiceRoomPlayerActivity
// Size: 0x0020
struct FVoiceRoomPlayerActivity
{
	class TArray<struct FActivePlayerVoice>            ActiveVoiceSummary;                            // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FVoiceRoomErrorMetric>         Errors;                                        // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.VoiceRoomDetails
// Size: 0x0028
struct FVoiceRoomDetails
{
	class FString                                      RoomName;                                      // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint8_t                                            RoomType;                                      // 0x0010 (0x0001) [0x0000000000000000]               
	uint8_t                                          UnknownData00[0x7];                            // 0x0011 (0x0007) MISSED OFFSET
	uint64_t                                           CreatedTimestamp;                              // 0x0018 (0x0008) [0x0000000000000000]               
	uint64_t                                           DestroyedTimestamp;                            // 0x0020 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.PlayerMessageInfo
// Size: 0x0020
struct FPlayerMessageInfo
{
	class FString                                      SenderId;                                      // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      DisplayName;                                   // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.VehicleInputs
// Size: 0x0020
struct FVehicleInputs
{
	float                                              Throttle;                                      // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Steer;                                         // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Pitch;                                         // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Yaw;                                           // 0x000C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Roll;                                          // 0x0010 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DodgeForward;                                  // 0x0014 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DodgeRight;                                    // 0x0018 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bHandbrake : 1;                                // 0x001C (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bJump : 1;                                     // 0x001C (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bActivateBoost : 1;                            // 0x001C (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           bHoldingBoost : 1;                             // 0x001C (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
	uint32_t                                           bJumped : 1;                                   // 0x001C (0x0004) [0x0000000000000000] [0x00000010] 
	uint32_t                                           bGrab : 1;                                     // 0x001C (0x0004) [0x0001000000000000] [0x00000020] 
	uint32_t                                           bButtonMash : 1;                               // 0x001C (0x0004) [0x0001000000000000] [0x00000040] 
	uint32_t                                           bTargetFind : 1;                               // 0x001C (0x0004) [0x0001000000000000] [0x00000080] 
};

// ScriptStruct TAGame._Types_TA.ClientOnlineProductStat
// Size: 0x0018 (0x0014 PropertySize + 0x0004 padding to satisfy MinAlignment of 8)
struct FClientOnlineProductStat
{
	struct FProductInstanceID                          InstanceID;                                    // 0x0000 (0x0010) [0x0000000000000000]               
	int32_t                                            Value;                                         // 0x0010 (0x0004) [0x0000000000000000]               
	uint8_t                                          MinAlignmentPadding[0x4];                      // 0x0014 (0x0004) PADDING FOR MINALIGNMENT
};

// ScriptStruct TAGame._Types_TA.RandomWeight
// Size: 0x0010
struct FRandomWeight
{
	class UObject*                                     Obj;                                           // 0x0000 (0x0008) [0x0000000000000000]               
	float                                              Weight;                                        // 0x0008 (0x0004) [0x0000000000000000]               
	float                                              OrigWeight;                                    // 0x000C (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.AssetLoadResult
// Size: 0x0020
struct FAssetLoadResult
{
	int32_t                                            ProductID;                                     // 0x0000 (0x0004) [0x0000000000000000]               
	class FName                                        AssetName;                                     // 0x0004 (0x0008) [0x0000000000000000]               
	uint8_t                                          UnknownData00[0x4];                            // 0x000C (0x0004) MISSED OFFSET
	class UProductAsset_TA*                            Asset;                                         // 0x0010 (0x0008) [0x0000000000000000]               
	class UProductThumbnailAsset_TA*                   ThumbnailAsset;                                // 0x0018 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.ProductThumbnailResult
// Size: 0x0018
struct FProductThumbnailResult
{
	class UProductAsset_TA*                            Asset;                                         // 0x0000 (0x0008) [0x0000000000000000]               
	class UOnlineProduct_TA*                           OnlineProduct;                                 // 0x0008 (0x0008) [0x0000000000000000]               
	class UProductThumbnail_TA*                        Thumbnail;                                     // 0x0010 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.MapImageLoadResult
// Size: 0x0010
struct FMapImageLoadResult
{
	class UTexture2D*                                  Image;                                         // 0x0000 (0x0008) [0x0000000000000000]               
	class FName                                        MapName;                                       // 0x0008 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.ClientLoadoutData
// Size: 0x0010
struct FClientLoadoutData
{
	class TArray<int32_t>                              Products;                                      // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.LoadoutTeamColor
// Size: 0x0008
struct FLoadoutTeamColor
{
	uint8_t                                            Team;                                          // 0x0000 (0x0001) [0x0000000000000000]               
	uint8_t                                            TeamColorID;                                   // 0x0001 (0x0001) [0x0000000000000000]               
	uint8_t                                            CustomColorID;                                 // 0x0002 (0x0001) [0x0000000000000000]               
	uint8_t                                          UnknownData00[0x1];                            // 0x0003 (0x0001) MISSED OFFSET
	uint32_t                                           bSet : 1;                                      // 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TAGame._Types_TA.LoadoutTeamPaint
// 0x0008 (0x0008 - 0x0010)
struct FLoadoutTeamPaint : FLoadoutTeamColor
{
	int32_t                                            TeamFinishID;                                  // 0x0008 (0x0004) [0x0000000000000000]               
	int32_t                                            CustomFinishID;                                // 0x000C (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.LoadoutData
// 0x0030 (0x0010 - 0x0040)
struct FLoadoutData : FClientLoadoutData
{
	struct FLoadoutTeamPaint                           TeamPaint;                                     // 0x0010 (0x0010) [0x0000000000000000]               
	class FName                                        Title;                                         // 0x0020 (0x0008) [0x0000000000000000]               
	int32_t                                            TeamIndex;                                     // 0x0028 (0x0004) [0x0000000000000000]               
	uint8_t                                          UnknownData00[0x4];                            // 0x002C (0x0004) MISSED OFFSET
	class TArray<struct FProductInstanceID>            OnlineProducts;                                // 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ClientLoadoutOnlineProduct
// Size: 0x0010
struct FClientLoadoutOnlineProduct
{
	class TArray<class UProductAttribute_TA*>          Attributes;                                    // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ClientLoadoutOnlineData
// Size: 0x0010
struct FClientLoadoutOnlineData
{
	class TArray<struct FClientLoadoutOnlineProduct>   Products;                                      // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.InputRate
// Size: 0x0008
struct FInputRate
{
	float                                              RiseRate;                                      // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              FallRate;                                      // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.TurningCircle
// Size: 0x0010
struct FTurningCircle
{
	struct FVector                                     Center;                                        // 0x0000 (0x000C) [0x0000000000000000]               
	float                                              Radius;                                        // 0x000C (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.GFxTeamColor
// Size: 0x0010
struct FGFxTeamColor
{
	struct FColor                                      Value;                                         // 0x0000 (0x0004) [0x0000000040000000] (CPF_DataBinding)
	int32_t                                            ColorID;                                       // 0x0004 (0x0004) [0x0000000040000000] (CPF_DataBinding)
	int32_t                                            X;                                             // 0x0008 (0x0004) [0x0000000040000000] (CPF_DataBinding)
	int32_t                                            Y;                                             // 0x000C (0x0004) [0x0000000040000000] (CPF_DataBinding)
};

// ScriptStruct TAGame._Types_TA.MapGroup
// Size: 0x0010
struct FMapGroup
{
	class TArray<class UMapData_TA*>                   Maps;                                          // 0x0000 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.StatValue
// Size: 0x0014
struct FStatValue
{
	class FName                                        Id;                                            // 0x0000 (0x0008) [0x0000000000000000]               
	int32_t                                            Values[3];                                     // 0x0008 (0x000C) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.VoiceRoomTokenRequest
// Size: 0x0020
struct FVoiceRoomTokenRequest
{
	class FString                                      RoomId;                                        // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FUniqueNetId>                  PlayerIds;                                     // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.PlayerIdArray
// Size: 0x0010
struct FPlayerIdArray
{
	class TArray<struct FUniqueNetId>                  Players;                                       // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ProductWithSettings
// Size: 0x0018
struct FProductWithSettings
{
	class UProductAsset_TA*                            Product;                                       // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UProductPaint_TA*                            Paint;                                         // 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UDataAsset_ESportsTeam_TA*                   ESportsTeam;                                   // 0x0010 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.ProductTradeInFilter
// Size: 0x0050
struct FProductTradeInFilter
{
	int32_t                                            Id;                                            // 0x0000 (0x0004) [0x0000000000000000]               
	uint8_t                                          UnknownData00[0x4];                            // 0x0004 (0x0004) MISSED OFFSET
	class FString                                      Label;                                         // 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<int32_t>                              SeriesIDs;                                     // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           bBlueprint : 1;                                // 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
	uint8_t                                          UnknownData01[0x4];                            // 0x002C (0x0004) MISSED OFFSET
	class TArray<uint8_t>                              Qualities;                                     // 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<class FString>                        TradeInQualities;                              // 0x0040 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ColorOverride
// Size: 0x0014
struct FColorOverride
{
	uint32_t                                           bOverride : 1;                                 // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FLinearColor                                Color;                                         // 0x0004 (0x0010) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.TeamColor
// Size: 0x0020
struct FTeamColor
{
	struct FLinearColor                                FontColor;                                     // 0x0000 (0x0010) [0x0000000000000000]               
	class TArray<struct FLinearColor>                  Colors;                                        // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.MapSkillSettings
// Size: 0x000C
struct FMapSkillSettings
{
	class FName                                        MapName;                                       // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              MinimumSkill;                                  // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.MaterialTextureParam
// Size: 0x0010
struct FMaterialTextureParam
{
	class FName                                        Name;                                          // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UTexture*                                    Value;                                         // 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.MaterialVectorParam
// Size: 0x0018
struct FMaterialVectorParam
{
	class FName                                        Name;                                          // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FLinearColor                                Value;                                         // 0x0008 (0x0010) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.MaterialScalarParam
// Size: 0x000C
struct FMaterialScalarParam
{
	class FName                                        Name;                                          // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              Value;                                         // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.MaterialParams
// Size: 0x0030
struct FMaterialParams
{
	class TArray<struct FMaterialTextureParam>         TextureParameters;                             // 0x0000 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<struct FMaterialVectorParam>          VectorParameters;                              // 0x0010 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<struct FMaterialScalarParam>          ScalarParameters;                              // 0x0020 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.AssociativeMaterialParams
// Size: 0x0038
struct FAssociativeMaterialParams
{
	class UMaterialInterface*                          Material;                                      // 0x0000 (0x0008) [0x0000000000020001] (CPF_Edit | CPF_EditConst)
	struct FMaterialParams                             Params;                                        // 0x0008 (0x0030) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.SkinBodySettings
// Size: 0x0048
struct FSkinBodySettings
{
	class UProductAssetReferenceBody_TA*               Body;                                          // 0x0000 (0x0008) [0x0000000004000001] (CPF_Edit | CPF_EditInline)
	struct FMaterialParams                             Parameters;                                    // 0x0008 (0x0030) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<struct FAssociativeMaterialParams>    AdditionalBodyParameters;                      // 0x0038 (0x0010) [0x0000000000400041] (CPF_Edit | CPF_EditFixedSize | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.UniqueNetIdGroup4
// Size: 0x0120
struct FUniqueNetIdGroup4
{
	struct FUniqueNetId                                PlayerIds[4];                                  // 0x0000 (0x0120) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.OnlineProductAttribute
// Size: 0x0018
struct FOnlineProductAttribute
{
	class FName                                        Key;                                           // 0x0000 (0x0008) [0x0000000000000000]               
	class FString                                      Value;                                         // 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.OnlineProductData
// Size: 0x0040
struct FOnlineProductData
{
	int32_t                                            ProductID;                                     // 0x0000 (0x0004) [0x0000000000000000]               
	uint8_t                                          UnknownData00[0x4];                            // 0x0004 (0x0004) MISSED OFFSET
	struct FProductInstanceID                          InstanceID;                                    // 0x0008 (0x0010) [0x0000000000000000]               
	int32_t                                            SeriesID;                                      // 0x0018 (0x0004) [0x0000000000000000]               
	uint8_t                                          UnknownData01[0x4];                            // 0x001C (0x0004) MISSED OFFSET
	class TArray<struct FOnlineProductAttribute>       Attributes;                                    // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            TradeHold;                                     // 0x0030 (0x0004) [0x0000000000000000]               
	uint8_t                                          UnknownData02[0x4];                            // 0x0034 (0x0004) MISSED OFFSET
	uint64_t                                           AddedTimestamp;                                // 0x0038 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.CurrencyProductData
// Size: 0x0010
struct U_Types_TA_FCurrencyProductData
{
	class UProduct_TA*                                 Product;                                       // 0x0000 (0x0008) [0x0000000000000000]               
	class UOnlineProduct_TA*                           OnlineProduct;                                 // 0x0008 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.Currency
// Size: 0x0060
struct FCurrency
{
	uint8_t                                            Type;                                          // 0x0000 (0x0001) [0x0000000000000000]               
	uint8_t                                          UnknownData00[0x3];                            // 0x0001 (0x0003) MISSED OFFSET
	class FName                                        Name;                                          // 0x0004 (0x0008) [0x0000000000000000]               
	uint32_t                                           bCanBeTraded : 1;                              // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            TradeHold;                                     // 0x0010 (0x0004) [0x0000000000000000]               
	uint8_t                                          UnknownData01[0x4];                            // 0x0014 (0x0004) MISSED OFFSET
	struct U_Types_TA_FCurrencyProductData             ProductData;                                   // 0x0018 (0x0010) [0x0000000000000000]               
	int32_t                                            CurrencyID;                                    // 0x0028 (0x0004) [0x0000000040000000] (CPF_DataBinding)
	int32_t                                            Id;                                            // 0x002C (0x0004) [0x0000000040000000] (CPF_DataBinding)
	int32_t                                            Amount;                                        // 0x0030 (0x0004) [0x0000000040000000] (CPF_DataBinding)
	uint8_t                                          UnknownData02[0x4];                            // 0x0034 (0x0004) MISSED OFFSET
	class UTexture*                                    LargeImage;                                    // 0x0038 (0x0008) [0x0000000040000000] (CPF_DataBinding)
	class UTexture*                                    SmallImage;                                    // 0x0040 (0x0008) [0x0000000040000000] (CPF_DataBinding)
	class FString                                      LocalizedName;                                 // 0x0048 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_DataBinding)
	uint64_t                                           UpdatedTimestamp;                              // 0x0058 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.OnlineXPModifier
// Size: 0x0038
struct FOnlineXPModifier
{
	class FName                                        Name;                                          // 0x0000 (0x0008) [0x0000000040000000] (CPF_DataBinding)
	float                                              Modifier;                                      // 0x0008 (0x0004) [0x0000000040000000] (CPF_DataBinding)
	uint8_t                                            ModifierType;                                  // 0x000C (0x0001) [0x0000000040000000] (CPF_DataBinding)
	uint8_t                                          UnknownData00[0x3];                            // 0x000D (0x0003) MISSED OFFSET
	int32_t                                            Value;                                         // 0x0010 (0x0004) [0x0000000040000000] (CPF_DataBinding)
	uint8_t                                          UnknownData01[0x4];                            // 0x0014 (0x0004) MISSED OFFSET
	class FString                                      LocalizedText;                                 // 0x0018 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_DataBinding)
	uint32_t                                           bPremium : 1;                                  // 0x0028 (0x0004) [0x0000000040000000] [0x00000001] (CPF_DataBinding)
	uint32_t                                           bPenalty : 1;                                  // 0x0028 (0x0004) [0x0000000040000000] [0x00000002] (CPF_DataBinding)
	uint32_t                                           bPromo : 1;                                    // 0x0028 (0x0004) [0x0000000040000000] [0x00000004] (CPF_DataBinding)
	int32_t                                            Remaining;                                     // 0x002C (0x0004) [0x0000000040000000] (CPF_DataBinding)
	int32_t                                            Count;                                         // 0x0030 (0x0004) [0x0000000040000000] (CPF_DataBinding)
	int32_t                                            MaxCount;                                      // 0x0034 (0x0004) [0x0000000040000000] (CPF_DataBinding)
};

// ScriptStruct TAGame._Types_TA.OnlineXPReward
// Size: 0x0040
struct FOnlineXPReward
{
	class FName                                        RewardName;                                    // 0x0000 (0x0008) [0x0000000000000000]               
	float                                              Total;                                         // 0x0008 (0x0004) [0x0000000000000000]               
	int32_t                                            Base;                                          // 0x000C (0x0004) [0x0000000000000000]               
	int32_t                                            BaseLevel;                                     // 0x0010 (0x0004) [0x0000000000000000]               
	int32_t                                            Level;                                         // 0x0014 (0x0004) [0x0000000000000000]               
	int32_t                                            CapAdjustment;                                 // 0x0018 (0x0004) [0x0000000000000000]               
	uint8_t                                          UnknownData00[0x4];                            // 0x001C (0x0004) MISSED OFFSET
	class TArray<int32_t>                              LevelThresholds;                               // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FOnlineXPModifier>             RewardModifiers;                               // 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.OnlineProductDrop
// Size: 0x0078
struct FOnlineProductDrop
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FOnlineProductData>            ProductData;                                   // 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FCurrency>                     CurrencyData;                                  // 0x0058 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FOnlineXPReward>               RewardDrops;                                   // 0x0068 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ChallengeRequirementProgress
// Size: 0x0008
struct FChallengeRequirementProgress
{
	int32_t                                            ProgressCount;                                 // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            ProgressChange;                                // 0x0004 (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.ChallengeProgress
// Size: 0x0028
struct FChallengeProgress
{
	int32_t                                            Id;                                            // 0x0000 (0x0004) [0x0000000000000000]               
	uint32_t                                           bIsHidden : 1;                                 // 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            CompleteCount;                                 // 0x0008 (0x0004) [0x0000000000000000]               
	uint32_t                                           bNotifyCompleted : 1;                          // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bNotifyAvailable : 1;                          // 0x000C (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bNotifyNewInfo : 1;                            // 0x000C (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bRewardsAvailable : 1;                         // 0x000C (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bComplete : 1;                                 // 0x000C (0x0004) [0x0000000000000000] [0x00000010] 
	uint64_t                                           ProgressResetTimeUTC;                          // 0x0010 (0x0008) [0x0000000000000000]               
	class TArray<struct FChallengeRequirementProgress> RequirementProgress;                           // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.XPRewardData
// Size: 0x000C
struct FXPRewardData
{
	class FName                                        Name;                                          // 0x0000 (0x0008) [0x0000000040000000] (CPF_DataBinding)
	float                                              Amount;                                        // 0x0008 (0x0004) [0x0000000040000000] (CPF_DataBinding)
};

// ScriptStruct TAGame._Types_TA.GarageSlotCost
// Size: 0x0008
struct FGarageSlotCost
{
	int32_t                                            Id;                                            // 0x0000 (0x0004) [0x0000000040000000] (CPF_DataBinding)
	int32_t                                            Amount;                                        // 0x0004 (0x0004) [0x0000000040000000] (CPF_DataBinding)
};

// ScriptStruct TAGame._Types_TA.ProductDrop
// Size: 0x0028 (0x0024 PropertySize + 0x0004 padding to satisfy MinAlignment of 8)
struct FProductDrop
{
	struct FProductHashID                              GroupId;                                       // 0x0000 (0x0004) [0x0000000040000000] (CPF_DataBinding)
	uint8_t                                          UnknownData00[0x4];                            // 0x0004 (0x0004) MISSED OFFSET
	struct FProductInstanceID                          DropID;                                        // 0x0008 (0x0010) [0x0000000040000000] (CPF_DataBinding)
	uint64_t                                           DropTime;                                      // 0x0018 (0x0008) [0x0000000040000000] (CPF_DataBinding)
	uint32_t                                           bCanEquipNow : 1;                              // 0x0020 (0x0004) [0x0000000040000000] [0x00000001] (CPF_DataBinding)
	uint8_t                                          MinAlignmentPadding[0x4];                      // 0x0024 (0x0004) PADDING FOR MINALIGNMENT
};

// ScriptStruct TAGame._Types_TA.RPCIntroCar
// Size: 0x0038
struct FRPCIntroCar
{
	int32_t                                            TemplateIndex;                                 // 0x0000 (0x0004) [0x0000000000000000]               
	uint8_t                                          UnknownData00[0x4];                            // 0x0004 (0x0004) MISSED OFFSET
	class FString                                      TemplateName;                                  // 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      TemplateDescription;                           // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<int32_t>                              ProductsList;                                  // 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.IntroCarInfo
// Size: 0x0028
struct FIntroCarInfo
{
	int32_t                                            TemplateIndex;                                 // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                          UnknownData00[0x4];                            // 0x0004 (0x0004) MISSED OFFSET
	class FString                                      TemplateName;                                  // 0x0008 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class FString                                      TemplateDescription;                           // 0x0018 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.EditorIntroCar
// Size: 0x0038
struct FEditorIntroCar
{
	struct FIntroCarInfo                               Info;                                          // 0x0000 (0x0028) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<class UProduct_TA*>                   ProductList;                                   // 0x0028 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.AppliedBreakoutDamage
// Size: 0x0018
struct FAppliedBreakoutDamage
{
	uint8_t                                            Id;                                            // 0x0000 (0x0001) [0x0000000000000000]               
	uint8_t                                          UnknownData00[0x3];                            // 0x0001 (0x0003) MISSED OFFSET
	struct FVector                                     Location;                                      // 0x0004 (0x000C) [0x0000000000000000]               
	int32_t                                            DamageIndex;                                   // 0x0010 (0x0004) [0x0000000000000000]               
	int32_t                                            TotalDamage;                                   // 0x0014 (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.PaintAttributeParameter
// Size: 0x0010
struct FPaintAttributeParameter
{
	uint8_t                                            PaintVariant;                                  // 0x0000 (0x0001) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                          UnknownData00[0x3];                            // 0x0001 (0x0003) MISSED OFFSET
	class FName                                        ParameterName;                                 // 0x0004 (0x0008) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bEnabled : 1;                                  // 0x000C (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bGammaCorrect : 1;                             // 0x000C (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
};

// ScriptStruct TAGame._Types_TA.ProductLevelData
// Size: 0x0010
struct FProductLevelData
{
	int32_t                                            Level;                                         // 0x0000 (0x0004) [0x0000000040000001] (CPF_Edit | CPF_DataBinding)
	int32_t                                            SoftCurrency;                                  // 0x0004 (0x0004) [0x0000000040000001] (CPF_Edit | CPF_DataBinding)
	int32_t                                            HardCurrency;                                  // 0x0008 (0x0004) [0x0000000040000001] (CPF_Edit | CPF_DataBinding)
	float                                              UnlockWeight;                                  // 0x000C (0x0004) [0x0000000040000001] (CPF_Edit | CPF_DataBinding)
};

// ScriptStruct TAGame._Types_TA.BallPredictionInfo
// Size: 0x003C
struct FBallPredictionInfo
{
	float                                              Time;                                          // 0x0000 (0x0004) [0x0000000000000000]               
	float                                              ArchTopTime;                                   // 0x0004 (0x0004) [0x0000000000000000]               
	struct FVector                                     Location;                                      // 0x0008 (0x000C) [0x0000000000000000]               
	struct FVector                                     Velocity;                                      // 0x0014 (0x000C) [0x0000000000000000]               
	struct FVector                                     ArchTop;                                       // 0x0020 (0x000C) [0x0000000000000000]               
	struct FVector                                     ArchTopVelocity;                               // 0x002C (0x000C) [0x0000000000000000]               
	uint32_t                                           bHitWall : 1;                                  // 0x0038 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bHitGround : 1;                                // 0x0038 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct TAGame._Types_TA.PlayerPrivateMatchData
// Size: 0x0050
struct FPlayerPrivateMatchData
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              GameSecondsPlayed;                             // 0x0048 (0x0004) [0x0000000000000000]               
	int32_t                                            GameScore;                                     // 0x004C (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.StatData
// Size: 0x000C
struct FStatData
{
	class FName                                        EventName;                                     // 0x0000 (0x0008) [0x0000000000000000]               
	int32_t                                            Count;                                         // 0x0008 (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.QuickChatGroup
// Size: 0x0018 (0x0014 PropertySize + 0x0004 padding to satisfy MinAlignment of 8)
struct FQuickChatGroup
{
	class FString                                      Key;                                           // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            Count;                                         // 0x0010 (0x0004) [0x0000000000000000]               
	uint8_t                                          MinAlignmentPadding[0x4];                      // 0x0014 (0x0004) PADDING FOR MINALIGNMENT
};

// ScriptStruct TAGame._Types_TA.OnlinePlayerMatchData
// Size: 0x0128 (0x0125 PropertySize + 0x0003 padding to satisfy MinAlignment of 8)
struct FOnlinePlayerMatchData
{
	class APRI_TA*                                     PRI;                                           // 0x0000 (0x0008) [0x0000000000002000] (CPF_Transient)
	struct FUniqueNetId                                PlayerID;                                      // 0x0008 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              GameSecondsPlayed;                             // 0x0050 (0x0004) [0x0000000000000000]               
	int32_t                                            GameScore;                                     // 0x0054 (0x0004) [0x0000000000000000]               
	int32_t                                            MatchGoals;                                    // 0x0058 (0x0004) [0x0000000000000000]               
	int32_t                                            MatchAssists;                                  // 0x005C (0x0004) [0x0000000000000000]               
	int32_t                                            MatchSaves;                                    // 0x0060 (0x0004) [0x0000000000000000]               
	int32_t                                            MatchShots;                                    // 0x0064 (0x0004) [0x0000000000000000]               
	int32_t                                            XPGained;                                      // 0x0068 (0x0004) [0x0001000000000000]               
	uint8_t                                          UnknownData00[0x4];                            // 0x006C (0x0004) MISSED OFFSET
	class TArray<struct FOnlineProductData>            Loadout;                                       // 0x0070 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           bCompletedMatch : 1;                           // 0x0080 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bForfeit : 1;                                  // 0x0080 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bMvp : 1;                                      // 0x0080 (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bWinner : 1;                                   // 0x0080 (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bLeaver : 1;                                   // 0x0080 (0x0004) [0x0000000000000000] [0x00000010] 
	uint32_t                                           bInParty : 1;                                  // 0x0080 (0x0004) [0x0000000000000000] [0x00000020] 
	uint32_t                                           bJoinedInProgress : 1;                         // 0x0080 (0x0004) [0x0000000000000000] [0x00000040] 
	int32_t                                            ConsecutiveMatchesPlayed;                      // 0x0084 (0x0004) [0x0000000000000000]               
	struct FUniqueNetId                                PartyLeader;                                   // 0x0088 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FUniqueNetId>                  PartyMembers;                                  // 0x00D0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            DistanceDrivenMeters;                          // 0x00E0 (0x0004) [0x0000000000000000]               
	uint32_t                                           bPartyLeaderValid : 1;                         // 0x00E4 (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            TeamIndex;                                     // 0x00E8 (0x0004) [0x0000000000000000]               
	uint8_t                                          UnknownData01[0x4];                            // 0x00EC (0x0004) MISSED OFFSET
	class TArray<struct FStatData>                     Stats;                                         // 0x00F0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FLoadoutData>                  TeamLoadouts;                                  // 0x0100 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FQuickChatGroup>               QuickChat;                                     // 0x0110 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           ForceDrop : 1;                                 // 0x0120 (0x0004) [0x0001000000000000] [0x00000001] 
	uint32_t                                           PreventDrop : 1;                               // 0x0120 (0x0004) [0x0001000000000000] [0x00000002] 
	uint8_t                                            InfectedByType;                                // 0x0124 (0x0001) [0x0001000000000000]               
	uint8_t                                          MinAlignmentPadding[0x3];                      // 0x0125 (0x0003) PADDING FOR MINALIGNMENT
};

// ScriptStruct TAGame._Types_TA.StatDataFloat
// Size: 0x000C
struct FStatDataFloat
{
	class FName                                        EventName;                                     // 0x0000 (0x0008) [0x0000000000000000]               
	float                                              Count;                                         // 0x0008 (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.ActorHistory
// Size: 0x0020
struct FActorHistory
{
	class FName                                        Name;                                          // 0x0000 (0x0008) [0x0000000000000000]               
	uint8_t                                            Type;                                          // 0x0008 (0x0001) [0x0000000000000000]               
	uint8_t                                          UnknownData00[0x7];                            // 0x0009 (0x0007) MISSED OFFSET
	class FString                                      SerializedHistory;                             // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.SortedProductData
// Size: 0x0038 (0x0034 PropertySize + 0x0004 padding to satisfy MinAlignment of 8)
struct FSortedProductData
{
	struct FProductInstanceID                          Id;                                            // 0x0000 (0x0010) [0x0000000000000000]               
	struct FProductHashID                              HashID;                                        // 0x0010 (0x0004) [0x0000000000000000]               
	uint8_t                                          UnknownData00[0x4];                            // 0x0014 (0x0004) MISSED OFFSET
	class UProduct_TA*                                 Product;                                       // 0x0018 (0x0008) [0x0000000000000000]               
	class UOnlineProduct_TA*                           OnlineProduct;                                 // 0x0020 (0x0008) [0x0000000000000000]               
	int32_t                                            BlueprintSortWeight;                           // 0x0028 (0x0004) [0x0000000000000000]               
	int32_t                                            Quantity;                                      // 0x002C (0x0004) [0x0000000000000000]               
	uint32_t                                           bUnlocked : 1;                                 // 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bIsFavorited : 1;                              // 0x0030 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bCurrency : 1;                                 // 0x0030 (0x0004) [0x0000000000000000] [0x00000004] 
	uint8_t                                          MinAlignmentPadding[0x4];                      // 0x0034 (0x0004) PADDING FOR MINALIGNMENT
};

// ScriptStruct TAGame._Types_TA.EditorRoundData
// Size: 0x0018
struct FEditorRoundData
{
	float                                              TimeLimit;                                     // 0x0000 (0x0004) [0x0000000040000000] (CPF_DataBinding)
	uint8_t                                          UnknownData00[0x4];                            // 0x0004 (0x0004) MISSED OFFSET
	class TArray<class FString>                        SerializedArchetypes;                          // 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.LoadObjectResult
// Size: 0x0028 (0x0021 PropertySize + 0x0007 padding to satisfy MinAlignment of 8)
struct FLoadObjectResult
{
	class FString                                      FilePath;                                      // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class UObject*                                     ObjectData;                                    // 0x0010 (0x0008) [0x0000000000000000]               
	class UError*                                      Error;                                         // 0x0018 (0x0008) [0x0000000000000000]               
	uint8_t                                            Code;                                          // 0x0020 (0x0001) [0x0000000000000000]               
	uint8_t                                          MinAlignmentPadding[0x7];                      // 0x0021 (0x0007) PADDING FOR MINALIGNMENT
};

// ScriptStruct TAGame._Types_TA.SaveObjectResult
// Size: 0x0018 (0x0011 PropertySize + 0x0007 padding to satisfy MinAlignment of 8)
struct FSaveObjectResult
{
	class UObject*                                     ObjectData;                                    // 0x0000 (0x0008) [0x0000000000000000]               
	class UError*                                      Error;                                         // 0x0008 (0x0008) [0x0000000000000000]               
	uint8_t                                            Code;                                          // 0x0010 (0x0001) [0x0000000000000000]               
	uint8_t                                          MinAlignmentPadding[0x7];                      // 0x0011 (0x0007) PADDING FOR MINALIGNMENT
};

// ScriptStruct TAGame._Types_TA.WeldingInfo
// Size: 0x0028 (0x0024 PropertySize + 0x0004 padding to satisfy MinAlignment of 8)
struct FWeldingInfo
{
	class ARBActor_TA*                                 RBActor;                                       // 0x0000 (0x0008) [0x0000000000000000]               
	struct FVector                                     Offset;                                        // 0x0008 (0x000C) [0x0000000000000000]               
	float                                              Mass;                                          // 0x0014 (0x0004) [0x0000000000000000]               
	struct FRotator                                    Rotation;                                      // 0x0018 (0x000C) [0x0000000000000000]               
	uint8_t                                          MinAlignmentPadding[0x4];                      // 0x0024 (0x0004) PADDING FOR MINALIGNMENT
};

// ScriptStruct TAGame._Types_TA.ChatBanInfo
// Size: 0x0010 (0x000C PropertySize + 0x0004 padding to satisfy MinAlignment of 8)
struct FChatBanInfo
{
	uint64_t                                           Expiration;                                    // 0x0000 (0x0008) [0x0000000000000000]               
	uint32_t                                           bPermanentlyBanned : 1;                        // 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	uint8_t                                          MinAlignmentPadding[0x4];                      // 0x000C (0x0004) PADDING FOR MINALIGNMENT
};

// ScriptStruct TAGame._Types_TA.PlayerChatMessage
// Size: 0x0068
struct FPlayerChatMessage
{
	float                                              MessageTimeStamp;                              // 0x0000 (0x0004) [0x0000000000000000]               
	uint8_t                                          UnknownData00[0x4];                            // 0x0004 (0x0004) MISSED OFFSET
	struct FUniqueNetId                                PlayerID;                                      // 0x0008 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	uint8_t                                            ChatChannel;                                   // 0x0050 (0x0001) [0x0000000000000000]               
	uint8_t                                          UnknownData01[0x3];                            // 0x0051 (0x0003) MISSED OFFSET
	int32_t                                            Team;                                          // 0x0054 (0x0004) [0x0000000000000000]               
	class FString                                      Message;                                       // 0x0058 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ReportedPlayerInfo
// Size: 0x00A8 (0x00A4 PropertySize + 0x0004 padding to satisfy MinAlignment of 8)
struct FReportedPlayerInfo
{
	struct FUniqueNetId                                Reporter;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FUniqueNetId                                Offender;                                      // 0x0048 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<int32_t>                              ReasonIDs;                                     // 0x0090 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              ReportTimeStamp;                               // 0x00A0 (0x0004) [0x0000000000000000]               
	uint8_t                                          MinAlignmentPadding[0x4];                      // 0x00A4 (0x0004) PADDING FOR MINALIGNMENT
};

// ScriptStruct TAGame._Types_TA.BoostOptionData
// Size: 0x0010
struct FBoostOptionData
{
	class FString                                      LocalizedName;                                 // 0x0000 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_DataBinding)
};

// ScriptStruct TAGame._Types_TA.GoalResetOptionData
// Size: 0x0020
struct FGoalResetOptionData
{
	class FString                                      LocalizedName;                                 // 0x0000 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_DataBinding)
	class FString                                      LocalizedDescription;                          // 0x0010 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_DataBinding)
};

// ScriptStruct TAGame._Types_TA.GameModeData
// Size: 0x0020 (0x001C PropertySize + 0x0004 padding to satisfy MinAlignment of 8)
struct FGameModeData
{
	int32_t                                            GameMode;                                      // 0x0000 (0x0004) [0x0000000040000000] (CPF_DataBinding)
	uint8_t                                          UnknownData00[0x4];                            // 0x0004 (0x0004) MISSED OFFSET
	class FString                                      LocalizedName;                                 // 0x0008 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_DataBinding)
	int32_t                                            SortIdx;                                       // 0x0018 (0x0004) [0x0000000040000000] (CPF_DataBinding)
	uint8_t                                          MinAlignmentPadding[0x4];                      // 0x001C (0x0004) PADDING FOR MINALIGNMENT
};

